[
  {
    "type_of_threat": "criminal",
    "summary": "Two young men were apprehended in Wieliczka after attempting to flee while applying graffiti. They were found with spray paint, pepper spray, and a knife branded with a soccer team's emblem. Later, a 20-year-old man was stopped with similar items in his car, also linked to a soccer club.",
    "location": "ul. św. Barbary, Wieliczka and unspecified residential area in Wieliczka",
    "date": "2025-10-04",
    "url": "https://cowkrakowie.pl/2025/10/podczas-proby-ucieczki-mlode-osoby-zostaly-zatrzymane-przez-policjantow",
    "latitude": 49.98587,
    "longitude": 20.06478
  },
  {
    "type_of_threat": "criminal",
    "summary": "Police pursued and arrested two men after they assaulted a 17-year-old. The suspects fled in a Peugeot after the assault. The pursuit ended in a nearby town. The men, linked to a pseudofanatic group, were found to be in possession of weapons and emblems. One of them drove without a license and both ignored police orders. They now face charges for assault, resisting arrest, and related offenses.",
    "location": "Sidzina, Kraków, and a town in the Kraków district",
    "date": "2025-10-02",
    "url": "https://cowkrakowie.pl/2025/10/policjanci-prowadzili-poscig-wczesniej-sprawcy-dokonali-pobicia",
    "latitude": 49.80577,
    "longitude": 19.88529
  },
  {
    "type_of_threat": "criminal",
    "summary": "A 43-year-old Ukrainian citizen, sought by Interpol with a red notice, was arrested in Skawina, Poland. She was wanted by Ukrainian justice for fraud, counterfeiting money, and corruption, and faced a 3-year, 6-month prison sentence.",
    "location": "Skawina, Poland",
    "date": "2025-10-02",
    "url": "https://cowkrakowie.pl/2025/10/za-ukrainka-wydano-najwyzszy-stopien-miedzynarodowych-poszukiwan",
    "latitude": 49.99833,
    "longitude": 19.85861
  },
  {
    "type_of_threat": "criminal",
    "summary": "A Ukrainian citizen was caught at Krakow Airport attempting to smuggle over 15 kg of human hair from Turkey, worth approximately 270,000 PLN, without declaring it to customs. A criminal fiscal proceeding has been initiated.",
    "location": "Krakow Airport",
    "date": "2025-10-01",
    "url": "https://cowkrakowie.pl/2025/10/15-kg-ludzkich-wlosow-na-lotnisku-w-krakowie",
    "latitude": 50.077778,
    "longitude": 19.784722
  },
  {
    "type_of_threat": "criminal",
    "summary": "A 47-year-old Polish citizen arriving at Krakow Airport from Bristol was arrested. He was wanted by the justice system and sentenced to a year in prison for theft with breaking and entering.",
    "location": "Krakow Airport, Krakow",
    "date": "2025-09-30T06:41:00+00:00",
    "url": "https://cowkrakowie.pl/2025/09/przylecial-do-krakowa-i-trafil-na-rok-do-wiezienia",
    "latitude": 50.07778,
    "longitude": 19.78472
  },
  {
    "type_of_threat": "criminal",
    "summary": "A 24-year-old Ukrainian woman was arrested in a Krakow hotel for her involvement in an organized crime group that defrauded a resident of Myślenice of over 400,000 złotych. She acted as a 'picker,' allowing her account to be used for money transfers. She fled to Ukraine after the fraud but was arrested when she visited Poland. Police seized $2400 from her. She faces up to 8 years in prison.",
    "location": "Krakow, Poland",
    "date": "2025-09-29T15:21:14+00:00",
    "url": "https://cowkrakowie.pl/2025/09/w-jednym-z-krakowskich-hoteli-zatrzymano-ukrainke-mloda-kobieta-byla-zaskoczona",
    "latitude": 50.06143,
    "longitude": 19.93658
  },
  {
    "type_of_threat": "criminal",
    "summary": "A man caused a disturbance in a restaurant and then attacked parked vehicles. Police apprehended the suspect, who was also found to be in possession of over 100 grams of mephedrone. He was charged with possessing a significant amount of narcotics and faces up to 10 years in prison.",
    "location": "Borek Fałęckiego (Kraków)",
    "date": "2025-09-27",
    "url": "https://cowkrakowie.pl/2025/09/agresor-awanturowal-sie-w-restauracji-oraz-uderzal-w-zaparkowane-samochody",
    "latitude": 49.99304,
    "longitude": 19.91452
  },
  {
    "type_of_threat": "criminal",
    "summary": "A 22-year-old citizen of Nepal was apprehended near Krakow's main bus station for illegal stay in Poland. He entered the country irregularly and applied for a temporary residence permit while already staying unlawfully. He was employed in the gastronomy sector. He was issued a return order with a 10-month ban from entering Poland and other Schengen area countries.",
    "location": "Near Krakow's main bus station (dworca głównego)",
    "date": "2025-09-26",
    "url": "https://cowkrakowie.pl/2025/09/wpadl-w-okolicy-dworca-glownego-musi-opuscic-polske",
    "latitude": 50.064778,
    "longitude": 19.945329
  },
  {
    "type_of_threat": "criminal",
    "summary": "A man died in a house fire in Zabierzów Bocheński. The Krakow prosecutor's office determined the fire was caused by arson and that the victim was alive during the fire. The man's wife has been charged with using gasoline as an accelerant to kill her husband.",
    "location": "Zabierzów Bocheński, near Krakow",
    "date": "2025-09-25",
    "url": "https://cowkrakowie.pl/2025/09/zona-podpalila-meza-mezczyzna-nie-zyje",
    "latitude": 50.03388,
    "longitude": 19.94209
  },
  {
    "type_of_threat": "criminal",
    "summary": "Two Ukrainian citizens entered the Krakow waterworks without permission. Initially, no illegal activity was found. Later, they were arrested on suspicion of drug-related crimes, which were not confirmed. The waterworks then filed a complaint, resulting in charges of property violation. The police requested the Border Guard to deport them.",
    "location": "Krakow waterworks on Wodociągowa street in Krakow, Poland",
    "date": "2025-09-23",
    "url": "https://cowkrakowie.pl/2025/09/wtargniecie-na-teren-krakowskich-wodociagow-stanowisko-policji",
    "latitude": 50.07273,
    "longitude": 19.99921
  }
]