[
  {
    "type_of_threat": "Vandalism, possession of dangerous items",
    "summary": "Two individuals were apprehended in Wieliczka after attempting to flee from police. They were found with spray paint, pepper spray, and a knife. Additionally, a vehicle was stopped containing a driver associated with pseudofans, who also had pepper spray and paint.",
    "location": "Wieliczka, ul. św. Barbary",
    "date": "2025-10-04",
    "url": "⁦https://cowkrakowie.pl/2025/10/podczas-proby-ucieczki-mlode-osoby-zostaly-zatrzymane-przez-policjantow⁩",
    "latitude": 49.98704,
    "longitude": 20.06607
  },
  {
    "type_of_threat": "assault, resisting arrest, and driving under the influence",
    "summary": "Police pursued and apprehended two men after they were involved in a physical assault. The suspects, who were also found with potential weapons and pseudofanatic emblems, were caught after a car chase which ended with their arrest. The suspects are connected to a group which is linked to a local sports club.",
    "location": "One of the streets in the Sidzina area and a town in the Krakow district",
    "date": "2025-10-02",
    "url": "⁦https://cowkrakowie.pl/2025/10/policjanci-prowadzili-poscig-wczesniej-sprawcy-dokonali-pobicia⁩",
    "latitude": 49.8106,
    "longitude": 19.83315
  },
  {
    "type_of_threat": "Oszustwa, fałszowanie pieniędzy i korupcja",
    "summary": "A 43-year-old Ukrainian woman wanted by Interpol for fraud, counterfeiting, and corruption was arrested in Skawina, Poland. She was sought by Ukrainian authorities and was to serve a 3-year and 6-month prison sentence.",
    "location": "Skawina, Poland",
    "date": "2025-10-02",
    "url": "⁦https://cowkrakowie.pl/2025/10/za-ukrainka-wydano-najwyzszy-stopien-miedzynarodowych-poszukiwan⁩",
    "latitude": 49.98544,
    "longitude": 19.88957
  },
  {
    "type_of_threat": "Smuggling",
    "summary": "A Ukrainian citizen was caught at Krakow airport attempting to smuggle over 15 kg of human hair, originating from Turkey, with an estimated value of 270,000 zł. The individual did not declare the goods, leading to a customs investigation.",
    "location": "Krakow Airport",
    "date": "2025-10-01",
    "url": "⁦https://cowkrakowie.pl/2025/10/15-kg-ludzkich-wlosow-na-lotnisku-w-krakowie⁩",
    "latitude": 50.0778,
    "longitude": 19.7846
  },
  {
    "type_of_threat": "Kradzież z włamaniem",
    "summary": "A Polish citizen arriving at Krakow Airport from Bristol was arrested by border guards because he was wanted for a one-year prison sentence for burglary. He was taken into custody directly from the airport.",
    "location": "Krakow Airport, Kraków",
    "date": "2025-09-30",
    "url": "⁦https://cowkrakowie.pl/2025/09/przylecial-do-krakowa-i-trafil-na-rok-do-wiezienia⁩",
    "latitude": 50.0774,
    "longitude": 19.7832
  },
  {
    "type_of_threat": "Fraud",
    "summary": "A 24-year-old Ukrainian woman was arrested in a Krakow hotel for her involvement in a fraud scheme. She acted as an intermediary, providing her bank account for money transfers. The police are investigating a group of fraudsters who have swindled over 400,000 PLN from a resident of Myślenice. She was found with $2400 in cash.",
    "location": "Krakow, Poland",
    "date": "2025-09-29",
    "url": "⁦https://cowkrakowie.pl/2025/09/w-jednym-z-krakowskich-hoteli-zatrzymano-ukrainke-mloda-kobieta-byla-zaskoczona⁩",
    "latitude": 50.06143,
    "longitude": 19.93658
  },
  {
    "type_of_threat": "Assault, Possession of Narcotics",
    "summary": "A man was arrested in Krakow after causing a disturbance in a restaurant and hitting parked cars. Police found him in possession of over 100 grams of mephedrone. He faces up to 10 years in prison for possession of a significant amount of narcotics.",
    "location": "Krakow, specifically in the area of Borek Fałęckiego.",
    "date": "2025-09-27",
    "url": "⁦https://cowkrakowie.pl/2025/09/agresor-awanturowal-sie-w-restauracji-oraz-uderzal-w-zaparkowane-samochody⁩",
    "latitude": 49.99282,
    "longitude": 19.92174
  },
  {
    "type_of_threat": "Illegal immigration",
    "summary": "A 22-year-old man from Nepal was apprehended near the Krakow Central Station for illegal stay in Poland. He had entered the country unlawfully and was working in the gastronomy sector. He received a deportation order and a 10-month ban from entering the Schengen area.",
    "location": "Krakow Central Station area",
    "date": "2025-09-26",
    "url": "⁦https://cowkrakowie.pl/2025/09/wpadl-w-okolicy-dworca-glownego-musi-opuscic-polske⁩",
    "latitude": 50.0609,
    "longitude": 19.9513
  },
  {
    "type_of_threat": "Arson, Homicide",
    "summary": "A woman in Krakow allegedly set her husband on fire, leading to his death. The incident happened in Zabierzów Bocheński. The man was found dead in the bathroom with a can of gasoline nearby. The wife, Magdalena S., has been arrested and charged with murder.",
    "location": "Zabierzów Bocheński (near Krakow)",
    "date": "2025-09-25",
    "url": "⁦https://cowkrakowie.pl/2025/09/zona-podpalila-meza-mezczyzna-nie-zyje⁩",
    "latitude": 50.01558,
    "longitude": 19.98797
  },
  {
    "type_of_threat": "Naruszenie miru domowego",
    "summary": "Twoi obywatele Ukrainy weszli na teren krakowskich wodociągów. Zostali zatrzymani przez policję. Początkowo zostali zwolnieni. Później zostali zatrzymani ponownie i usłyszeli zarzuty naruszenia miru domowego. Policja wystąpiła do Straży Granicznej z wnioskiem o wydanie decyzji o zobowiązaniu cudzoziemców do opuszczenia Polski.",
    "location": "Teren krakowskich wodociągów przy ul. Wodociągowej",
    "date": "2025-09-23",
    "url": "⁦https://cowkrakowie.pl/2025/09/wtargniecie-na-teren-krakowskich-wodociagow-stanowisko-policji⁩",
    "latitude": 50.05131,
    "longitude": 19.98003
  }
]